# Оценки текстом
# Напишите программу, которая преобразует список оценок по системе от 1 до 5 в текстовое представление. Нужно сохранить
# в списках числовой результат и текстовое представление. Где, 5 — "отлично", 3-4 — "хорошо", а 2 и ниже — "неудовлетворительно".
# Данные:
# grades = [5, 3, 4, 2, 1, 5, 3]
# Пример вывода:
# [[5, 'отлично'], [3, 'хорошо'], [4, 'хорошо'], [2, 'неудовлетворительно'], [1, 'неудовлетворительно'], [5, 'отлично'], [3, 'хорошо']]
grades = [5, 3, 4, 2, 1, 5, 3]
list1 = [1,2,3,4,5]
list2  = ['неудовлетворительно', 'неудовлетворительно', 'хорошо', 'хорошо', 'отлично']
new_list = []
for g in grades:
    index = list1.index(g)
    notes = list2[index]
    new_list.append([g, notes])
print(new_list)

grades = [5, 3, 4, 2, 1, 5, 3]
grade_name = [
    [1, 'Неудовлетворительно'],
    [2, 'Неудовлетворительно'],
    [3, 'Хорошо'],
    [4, 'Хорошо'],
    [5, 'Отлично']
]
#print(grade_name[4][0])
result = [[g, grade_name[g-1][1]] for g in grades if grade_name[g-1][0]==g ]
print(result)


# Правильные скобки
# string = "({[}])"
# Пример вывода:
# Скобки: ({[}])
# Валидны: False
# Скобки: ([({}()){}])
# Валидны: True
string = "c([({}(gg)5){}])"
#string = ")({[}])"
#string = "({[}])"
steck = []
rez   = True
for num, i in enumerate(string):
    if i in "([{": steck.append(i)
    if steck:
        if i == ")":
            if steck[-1] == "(": steck.pop()
        if i == "]":
            if steck[-1] == "[": steck.pop()
        if i == "}":
            if steck[-1] == "{": steck.pop()
#    print(num, i, steck)
if steck != [] : rez = False
print("Валидны: ", rez)
